driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/XSDVariables_SimpleTypes/Actual_20130311131752_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Comment xmlns="http://stc.com/xsddatatype_simpleTypes1" xmlns:msgns="http://stc.com/xsddatatype_simpleTypes1">Simple Type Assign Test: xsd:string :Input String</Comment>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>