driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/XSDVariables_SimpleTypes/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://stc.com/xsddatatype_simpleTypes1">
  <soapenv:Body>
    <ns0:Comment>Input String</ns0:Comment>
  </soapenv:Body>
</soapenv:Envelope>